#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/jameswcurtin/do-k8s-cluster/runs/run-Xka5C2zbBxhhz4WD

Waiting for the plan to start...

Terraform v1.1.8
on linux_amd64
Initializing plugins and modules...
random_id.cluster_id: Refreshing state... [id=E40GLQ]
digitalocean_loadbalancer.this: Refreshing state... [id=f6ce579e-14a8-4958-bb45-ca67f26b212d]
digitalocean_record.loadbalancer_subdomain: Refreshing state... [id=306458646]
digitalocean_kubernetes_cluster.this: Refreshing state... [id=a4a2d3de-c7e7-4baa-b487-b558044f2530]
module.gatekeeper.helm_release.gatekeeper: Refreshing state... [id=gatekeeper]
module.ntfy.helm_release.nfty: Refreshing state... [id=ntfy]
module.ingress_controller.helm_release.ingress_nginx: Refreshing state... [id=ingress-nginx]
module.gatekeeper.kubectl_manifest.uniqueingresshost_template: Refreshing state... [id=/apis/templates.gatekeeper.sh/v1/constrainttemplates/k8suniqueingresshost]
module.gatekeeper.kubectl_manifest.uniqueingresshost_constraint: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/k8suniqueingresshosts/unique-ingress-host]
module.external_dns.kubernetes_namespace.external_dns: Refreshing state... [id=external-dns]
module.cert_automation.helm_release.cert_manager: Refreshing state... [id=cert-manager]
module.external_dns.kubernetes_secret.digital_ocean_token: Refreshing state... [id=external-dns/digital-ocean-token]
module.external_dns.helm_release.external_dns: Refreshing state... [id=external-dns]
module.cert_automation.helm_release.cluster_issuer: Refreshing state... [id=cluster-issuer]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # digitalocean_kubernetes_cluster.this has changed
  ~ resource "digitalocean_kubernetes_cluster" "this" {
        id             = "a4a2d3de-c7e7-4baa-b487-b558044f2530"
      ~ kube_config    = (sensitive value)
        name           = "k8s-nyc3-138d062d"
        tags           = []
      ~ updated_at     = "2022-11-10 23:26:17 +0000 UTC" -> "2022-11-18 03:00:27 +0000 UTC"
        # (13 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.gatekeeper.kubectl_manifest.httpsonly_constraint will be created
  + resource "kubectl_manifest" "httpsonly_constraint" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "K8sHttpsOnly"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "ingress-https-only"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sHttpsOnly
            metadata:
              name: ingress-https-only
            spec:
              match:
                kinds:
                - apiGroups:
                  - extensions
                  - networking.k8s.io
                  kinds:
                  - Ingress
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.gatekeeper.kubectl_manifest.httpsonly_template will be created
  + resource "kubectl_manifest" "httpsonly_template" {
      + api_version             = "templates.gatekeeper.sh/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ConstraintTemplate"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "k8shttpsonly"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: templates.gatekeeper.sh/v1
            kind: ConstraintTemplate
            metadata:
              annotations:
                description: |-
                  Requires Ingress resources to be HTTPS only.  Ingress resources must include the `kubernetes.io/ingress.allow-http` annotation, set to `false`. By default a valid TLS {} configuration is required, this can be made optional by setting the `tlsOptional` parameter to `true`.
                  https://kubernetes.io/docs/concepts/services-networking/ingress/#tls
                metadata.gatekeeper.sh/title: HTTPS only
                metadata.gatekeeper.sh/version: 1.0.0
              name: k8shttpsonly
            spec:
              crd:
                spec:
                  names:
                    kind: K8sHttpsOnly
                  validation:
                    openAPIV3Schema:
                      description: Requires Ingress resources to be HTTPS only.  Ingress resources
                        must include the `kubernetes.io/ingress.allow-http` annotation, set to
                        `false`. By default a valid TLS {} configuration is required, this can
                        be made optional by setting the `tlsOptional` parameter to `true`.
                      properties:
                        tlsOptional:
                          description: When set to `true` the TLS {} is optional, defaults to
                            false.
                          type: boolean
                      type: object
              targets:
              - rego: |
                  package k8shttpsonly
            
                  violation[{"msg": msg}] {
                    input.review.object.kind == "Ingress"
                    re_match("^(extensions|networking.k8s.io)/", input.review.object.apiVersion)
                    ingress := input.review.object
                    not https_complete(ingress)
                    not tls_is_optional(ingress)
                    msg := sprintf("Ingress should be https. tls configuration and allow-http=false annotation are required for %v", [ingress.metadata.name])
                  }
            
                  violation[{"msg": msg}] {
                    input.review.object.kind == "Ingress"
                    re_match("^(extensions|networking.k8s.io)/", input.review.object.apiVersion)
                    ingress := input.review.object
                    not annotation_complete(ingress)
                    not tls_not_optional(ingress)
                    msg := sprintf("Ingress should be https. The allow-http=false annotation is required for %v", [ingress.metadata.name])
                  }
            
                  https_complete(ingress) = true {
                    ingress.spec["tls"]
                    count(ingress.spec.tls) > 0
                    ingress.metadata.annotations["kubernetes.io/ingress.allow-http"] == "false"
                  }
            
                  annotation_complete(ingress) = true {
                    ingress.metadata.annotations["kubernetes.io/ingress.allow-http"] == "false"
                  }
            
                  tls_is_optional(ingress) = true {
                    parameters := object.get(input, "parameters", {})
                    tlsOptional := object.get(parameters, "tlsOptional", false)
                    is_boolean(tlsOptional)
                    true == tlsOptional
                  }
            
                  tls_not_optional(ingress) = true {
                    parameters := object.get(input, "parameters", {})
                    tlsOptional := object.get(parameters, "tlsOptional", false)
                    true != tlsOptional
                  }
                target: admission.k8s.gatekeeper.sh
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.ntfy.helm_release.nfty will be destroyed
  # (because helm_release.nfty is not in configuration)
  - resource "helm_release" "nfty" {
      - atomic                     = false -> null
      - chart                      = "modules/ntfy/charts/ntfy" -> null
      - cleanup_on_fail            = true -> null
      - create_namespace           = true -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = true -> null
      - id                         = "ntfy" -> null
      - lint                       = false -> null
      - max_history                = 3 -> null
      - metadata                   = [
          - {
              - app_version = ""
              - chart       = "ntfy"
              - name        = "ntfy"
              - namespace   = "ntfy"
              - revision    = 3
              - values      = jsonencode(
                    {
                      - hostname  = "(sensitive value)"
                      - subdomain = "pusher"
                      - timezone  = "America/New_York"
                    }
                )
              - version     = "0.1.0"
            },
        ] -> null
      - name                       = "ntfy" -> null
      - namespace                  = "ntfy" -> null
      - pass_credentials           = false -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 300 -> null
      - verify                     = false -> null
      - version                    = "0.1.0" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null

      - set {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      - set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "timezone" but a value
│ was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-Xka5C2zbBxhhz4WD/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "ntfy_subdomain" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-Xka5C2zbBxhhz4WD/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pusher: @renovate[bot], Action: `pull_request`*